
public class Opr01 {

	public static void main(String[] args) {
		
		int a = 10, b = 4, c;
		
		c = a + b;
	//  0 = 10 + 4;
	// 14
		System.out.println(a + " + " + b + " = " + c);		// "10 + 4 = 14"
		//				  10 + " + " + 4 + " = " + 14;
		//				 "10"+ " + "
		//				     "10 + " + 4
		//					 "10 + " +"4"
		//						"10 + 4" + " = "
		//							"10 + 4 = "  + 14
		//							"10 + 4 = "  +"14"
		//								"10 + 4 = 14"
		
	//  현재: int a = 10, b = 4, c = 14;
		
		c = a - b;
	// 14 =10 - 4;
	//    = 6;
	//	6 =
	
		System.out.println(a + " - " + b + " = " + c);		// "10 - 4 = 6"
		
	//  현재: int a = 10, b = 4, c = 6;
		
		c = a * b;
	//  6 =10 * 4;
	//    = 40;
	// 40 =
		
		System.out.println(a + " X  " + b + " = " + c); 	// "10 X 4 = 40"
		
	//  현재: int a = 10, b = 4, c = 40;
		
		c = a / b;
		// 10 나누기 4의 몫은 2.5가 아니라 2입니다.(정수끼리의 나눗셈이므로 소수점 버림)
	// 40 = 10/ 4;
	//	  =  2;
	//  2 =
		
		System.out.println(a + " /  " + b + " = " + c); 	// "10 / 4 = 2"
		
	//  현재: int a = 10, b = 4, c = 2;
		
		c = a % b;
		// 10을 4로 나눴을때 몫은 2이고, '나머지' 가 2가 남습니다.
		// -> 10을 4로 나눴을 때 나머지 값 구하기
	//  2 = 10% 4;
	//	  =  2;
	//  2 =
		
		System.out.println(a + " %  " + b + " = " + c); 	// "10 % 4 = 2"
		
	}

}
